# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
sports=pd.Series([1,2,3,4],index=['Cricket','Football','Basketball','Golf'])
sports

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [3]:
sports['Football']

2

In [4]:
sports1=pd.Series([11,2,3,4],index=['Cricket','Football','Basketball','Golf'])
sports1

Cricket       11
Football       2
Basketball     3
Golf           4
dtype: int64

In [5]:
sports+sports1

Cricket       12
Football       4
Basketball     6
Golf           8
dtype: int64

In [6]:
df=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H '.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df

     Score1    Score2    Score3    Score4    Score5
A  0.006195  0.424561  0.122144  0.221503  0.115276
B  0.355453  0.714078  0.624264  0.727009  0.813108
C  0.646970  0.972412  0.495066  0.709973  0.601645
D  0.366493  0.775960  0.640222  0.675484  0.734790
E  0.618237  0.515641  0.691422  0.422826  0.208645
F  0.759922  0.374360  0.088726  0.709312  0.823562
G  0.323851  0.450298  0.202854  0.601047  0.150769
H  0.486363  0.835384  0.493613  0.692931  0.643859

In [7]:
df['Score1']

A    0.006195
B    0.355453
C    0.646970
D    0.366493
E    0.618237
F    0.759922
G    0.323851
H    0.486363
Name: Score1, dtype: float64

In [8]:
df[['Score1','Score2']]

     Score1    Score2
A  0.006195  0.424561
B  0.355453  0.714078
C  0.646970  0.972412
D  0.366493  0.775960
E  0.618237  0.515641
F  0.759922  0.374360
G  0.323851  0.450298
H  0.486363  0.835384

In [9]:
df['Score6']=df['Score1']+df['Score2']
df

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.006195  0.424561  0.122144  0.221503  0.115276  0.430756
B  0.355453  0.714078  0.624264  0.727009  0.813108  1.069531
C  0.646970  0.972412  0.495066  0.709973  0.601645  1.619382
D  0.366493  0.775960  0.640222  0.675484  0.734790  1.142453
E  0.618237  0.515641  0.691422  0.422826  0.208645  1.133878
F  0.759922  0.374360  0.088726  0.709312  0.823562  1.134282
G  0.323851  0.450298  0.202854  0.601047  0.150769  0.774149
H  0.486363  0.835384  0.493613  0.692931  0.643859  1.321747

In [11]:
df1={'ID':['101','102','103','107','176'],'Name':['John','Mercy','Aman','Kavin','Lally'],'Profit':[20,54,56,87,123]}
df2=pd.DataFrame(df1)
df2

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103   Aman      56
3  107  Kavin      87
4  176  Lally     123

In [12]:
df2['ID']

0    101
1    102
2    103
3    107
4    176
Name: ID, dtype: object

In [13]:
df2[['ID','Name']]

    ID   Name
0  101   John
1  102  Mercy
2  103   Aman
3  107  Kavin
4  176  Lally

In [20]:
df2

    Name  Profit
0   John      20
1  Mercy      54
2   Aman      56
3  Kavin      87
4  Lally     123

### Importing Datasets using Pandas

In [23]:
df=pd.read_csv("CardioGoodFitness-1.csv")

In [24]:
df.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47